[
  "It is impossible to lick your elbow (busted)",
  "A crocodile can't stick it's tongue out.",
  "A shrimp's heart is in it's head.",
  "People say 'Bless you' when you sneeze because when you sneeze,your heart stops for a mili-second.",
  "It is physically impossible for pigs to look up into the sky.",
  "A pregnant goldfish is called a twit. (busted?)",
  "More than % of the people in the world have never made or received a telephone call.",
  "Rats and horses can't vomit.",
  "If you sneeze too hard, you can fracture a rib.",
  "If you try to suppress a sneeze, you can rupture a blood vessel in your head or neck and die.",
  "If you keep your eyes open by force when you sneeze, you might pop an eyeball out.",
  "Rats multiply so quickly that in  months, two rats could have over a million descendants.",
  "Wearing headphones for just an hour will increase the bacteria in your ear by  times.",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "The cigarette lighter was invented before the match.",
  "Thirty-five percent of the people who use personal ads for dating are already married.",
  "A duck's quack doesn't echo, and no one knows why.",
  "% of all photocopier faults worldwide are caused by people sitting on them and photocopying their butts.",
  "In the course of an average lifetime you will, while sleeping, eat  assorted insects and  spiders.",
  "Most lipstick contains fish scales.",
  "Like fingerprints, everyone's tongue print is different.",
  "Over % of people who read this will try to lick their elbow.",
  "A crocodile can't move its tongue and cannot chew. Its digestive juices are so strong that it can digest a steel nail.",
  "A person can live without food for about a month, but only about a week without water.",
  "If the amount of water in your body is reduced by just %, you'll feel thirsty.",
  "If it's reduced by %, you'll die.",
  "Ethernet is a registered trademark of Xerox, Unix is a registered trademark of AT&T.",
  "Bill Gates' first business was Traff-O-Data, a company that created machines which recorded the number of cars passing a given point on a road.",
  "Uranus' orbital axis is tilted at  degrees.",
  "Outside the USA, Ireland is the largest software producing country in the world.",
  "Figlet, an ASCII font converter program, stands for Frank, Ian and Glenn's LETters.",
  "Every human spent about half an hour as a single cell.",
  "Every year about % of atoms in your body are replaced.",
  "Hot water is heavier than cold.",
  "Plutonium - first weighed on August th, , by University of Chicago scientists Glenn Seaborg and his colleagues - was the first man-made element.",
  "If you went out into space, you would explode before you suffocated because there's no air pressure.",
  "The radioactive substance, Americanium -  is used in many smoke detectors.",
  "Sound travels  times faster through steel than through the air.",
  "On average, half of all false teeth have some form of radioactivity.",
  "Only one satellite has been ever been destroyed by a meteor: the European Space Agency's Olympus in .",
  "A ball of glass will bounce higher than a ball of rubber. A ball of solid steel will bounce higher than one made entirely of glass.",
  "A chip of silicon a quarter-inch square has the capacity of the original  ENIAC computer, which occupied a city block.",
  "Ostriches are often not taken seriously. They can run faster than horses, and the males can roar like lions.",
  "Seals used for their fur get extremely sick when taken aboard ships.",
  "Sloths take two weeks to digest their food.",
  "Guinea pigs and rabbits can't sweat.",
  "The porpoise is second to man as the most intelligent animal on the planet.",
  "Young beavers stay with their parents for the first two years of their lives before going out on their own.",
  "Skunks can accurately spray their smelly fluid as far as ten feet.",
  "Deer can't eat hay.",
  "Gopher snakes in Arizona are not poisonous, but when frightened they may hiss and shake their tails like rattlesnakes.",
  "On average, dogs have better eyesight than humans, although not as colorful.",
  "The duckbill platypus can store as many as six hundred worms in the pouches of its cheeks.",
  "The lifespan of a squirrel is about nine years.",
  "North American oysters do not make pearls of any value.",
  "Human birth control pills work on gorillas.",
  "Gorillas sleep as much as fourteen hours per day.",
  "A biological reserve has been made for golden toads because they are so rare.",
  "There are more than fifty different kinds of kangaroos.",
  "The female lion does ninety percent of the hunting.",
  "A group of twelve or more cows is called a flink.",
  "You can tell the sex of a horse by its teeth. Most males have , females have .",
  "(removed, duplicated)",
  "The  on Heinz ketchup bottle represents the varieties of pickle the company once had.",
  "Your stomach produces a new layer of mucus every two weeks - otherwise it will digest itself.",
  "The Declaration of Independence was written on hemp paper.",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continuously from the bottom of the glass to the top.",
  "Susan Lucci is the daughter of Phyllis Diller.",
  "(removed, duplicated)",
  " entries in Webster's  Dictionary were misspelled.",
  "On average,  newborns will be given to the wrong parents daily.",
  "During the chariot scene in 'Ben Hur' a small red car can be seen in the distance.",
  "Warren Beatty and Shirley MacLaine are brother and sister.",
  "Orcas (killer whales) kill sharks by torpedoing up into the shark's stomach from underneath, causing the shark to explode.",
  "(removed, duplicated)",
  "Donald Duck comics were banned from Finland because he doesn't wear any pants.",
  "Ketchup was sold in the s as medicine.",
  "Leonardo da Vinci could write with one hand and draw with the other at the same time.",
  "Because metal was scarce, the Oscars given out during World War II were made of wood.",
  "There are no clocks in Las Vegas gambling casinos.",
  "The name Wendy was made up for the book Peter Pan, there was never a recorded Wendy before!",
  "There are no words in the dictionary that rhyme with: orange, purple, and silver!",
  "Leonardo Da Vinci invented scissors.",
  "A tiny amount of liquor on a scorpion will make it instantly go mad and sting itself to death.",
  "The mask used by Michael Myers in the original 'Halloween' was a Captain Kirk mask painted white.",
  "Chewing gum while peeling onions will keep you from crying!",
  "The glue on Israeli postage stamps is certified kosher.",
  "Guinness Book of Records holds the record for being the book most often stolen from Public Libraries.",
  "Astronauts are not allowed to eat beans before they go into space because passing wind in a space suit damages them.",
  "Beetles taste like apples, wasps like pine nuts, and worms like fried bacon.",
  "Of all the words in the English language, the word ’set’ has the most definitions!",
  "What is called a 'French kiss' in the English speaking world is known as an 'English kiss' in France.",
  "'Almost' is the longest word in the English language with all the letters in alphabetical order.",
  "'Rhythm' is the longest English word without a vowel.",
  "In , a pig in France was executed by public hanging for the murder of a child",
  "(removed, duplicated)",
  "Human thigh bones are stronger than concrete.",
  "You can’t kill yourself by holding your breath",
  "There is a city called Rome on every continent.",
  "It’s against the law to have a pet dog in Iceland.",
  "Your heart beats over , times a day.",
  "The skeleton of Jeremy Bentham is present at all important meetings of the University of London",
  "Right handed people live, on average, nine years longer than left-handed people",
  "Your ribs move about  million times a year, everytime you breathe!",
  "The elephant is the only mammal that can’t jump!",
  "One quarter of the bones in your body, are in your feet!",
  "(removed, duplicated)",
  "Fingernails grow nearly  times faster than toenails!",
  "Most dust particles in your house are made from dead skin!",
  "The present population of  billion plus people of the world is predicted to become  billion by .",
  "Women blink nearly twice as much as men.",
  "Adolf Hitler was a vegetarian, and had only ONE testicle.",
  "Months that begin on a Sunday will always have a 'Friday the th.'",
  "Coca-Cola would be green if colouring weren’t added to it.",
  "On average a hedgehog’s heart beats  times a minute.",
  "More people are killed each year from bees than from snakes.",
  "The average lead pencil will draw a line  miles long or write approximately , English words.",
  "More people are allergic to cow’s milk than any other food.",
  "Camels have three eyelids to protect themselves from blowing sand.",
  "The placement of a donkey’s eyes in its’ heads enables it to see all four feet at all times!",
  "The six official languages of the United Nations are: English, French, Arabic, Chinese, Russian and Spanish.",
  "Earth is the only planet not named after a god.",
  "It’s against the law to burp, or sneeze in a church in Nebraska, USA.",
  "You’re born with  bones, but by the time you become an adult, you only have .",
  "Some worms will eat themselves if they can’t find any food!",
  "Dolphins sleep with one eye open!",
  "It is impossible to sneeze with your eyes open",
  "The worlds oldest piece of chewing gum is  years old!",
  "The longest recorded flight of a chicken is  seconds",
  "Slugs have  noses.",
  "Owls are the only birds who can see the colour blue.",
  "A man named Charles Osborne had the hiccups for  years!",
  "A giraffe can clean its ears with its -inch tongue!",
  "The average person laughs  times a day!",
  "An ostrich’s eye is bigger than its brain",
  "If you yelled for  years,  months and  days you would have produced enough sound energy to heat one cup of coffee.",
  "If you farted consistently for  years and  months, enough gas is produced to create the energy of an atomic bomb.",
  "The human heart! creates enough pressure when it pumps out to the body to squirt blood  feet.",
  "A pig's orgasm lasts  minutes.",
  "A cockroach will live for weeks without its head before it starves to death",
  "Banging your head against a wall uses  calories a hour",
  "The flea can jump  times its body length. It's like a human jumping the length of a football field.",
  "The catfish has over , taste buds.",
  "Some lions mate over  times a day.",
  "Butterflies taste with their feet.",
  "The strongest muscle in the body is the tongue.",
  "A cat's urine glows under a black light.",
  "(removed, duplicated)",
  "Starfish have no brains.",
  "Polar bears are left-handed.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "In France, it is legal to marry a dead person (Contributed by Loes -  May )"
]